Table of Contents
 Class TimePoint
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Point on time axis
public class TimePoint : OpenObject
Inheritance
object
OpenObject
TimePoint
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 TimePoint()
Constructor
public TimePoint()
Properties
 Age
Age
public double Age { get; set; }
Property Value
double
 AllowCheckInAgeLess3Days
true to allow chec in age less 3 days
public bool AllowCheckInAgeLess3Days { get; set; }
Property Value
bool
 Description
Description
public string Description { get; set; }
Property Value
string
 Fix2DRotation
true to fix around Y axis ( Mz is not taken into account )
public bool Fix2DRotation { get; set; }
Property Value
bool
 LastConstructionStage
Last construction stage - Time of the start of cyclic loading for fatigue check
public bool LastConstructionStage { get; set; }
Property Value
bool
 Name
Name of time point
public string Name { get; set; }
Property Value
string
 Prestressing
Prestressing
public bool Prestressing { get; set; }
Property Value
bool
 Stage
Stage
public bool Stage { get; set; }
Property Value
bool
 Time
Time
public double Time { get; set; }
Property Value
double
 Edit this page